fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/Forms/ВКМ_ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВКМ_ДобавитьСозданныеРеквизиты();
	ВКМ_ИзменитьВидимостьГруппыПараметрыОбслуживанияНаСервере();	
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	ВКМ_ИзменитьВидимостьГруппыПараметрыОбслуживания();
	
КонецПроцедуры
#КонецОбласти



#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВКМ_ДобавитьСозданныеРеквизиты()

	ВКМ_ГруппаПараметрыОбслуживания = Элементы.Добавить("ВКМ_ГруппаПараметрыОбслуживания", Тип("ГруппаФормы"), ЭтотОбъект);
	ВКМ_ГруппаПараметрыОбслуживания.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ВКМ_ГруппаПараметрыОбслуживания.ОтображатьЗаголовок = Истина;
	ВКМ_ГруппаПараметрыОбслуживания.Заголовок = "Данные договора абонентского обслуживания";
	ВКМ_ГруппаПараметрыОбслуживания.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ВКМ_ГруппаПараметрыОбслуживания.Поведение = ПоведениеОбычнойГруппы.Свертываемая;
	ВКМ_ГруппаПараметрыОбслуживания.ОтображатьОтступСлева = Истина;
	ВКМ_ГруппаПараметрыОбслуживания.Отображение = ОтображениеОбычнойГруппы.Нет;
	ВКМ_ГруппаПараметрыОбслуживания.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.Картинка;
	
	ВКМ_ДекорацияДатаОбслуживания = Элементы.Добавить("ВКМ_ДекорацияПериодОбслуживания", Тип("ДекорацияФормы"), ВКМ_ГруппаПараметрыОбслуживания);
	ВКМ_ДекорацияДатаОбслуживания.Вид = ВидДекорацииФормы.Надпись;
	ВКМ_ДекорацияДатаОбслуживания.Заголовок = "Период действия договора:";
	
	ВКМ_ГруппаДатаОбслуживания = Элементы.Добавить("ВКМ_ГруппаДатаОбслуживания", Тип("ГруппаФормы"), ВКМ_ГруппаПараметрыОбслуживания);
	ВКМ_ГруппаДатаОбслуживания.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ВКМ_ГруппаДатаОбслуживания.ОтображатьЗаголовок = Ложь;
	ВКМ_ГруппаДатаОбслуживания.Заголовок = "Период действия договора";
	ВКМ_ГруппаДатаОбслуживания.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ВКМ_ГруппаДатаОбслуживания.ОтображатьОтступСлева = Истина;
		
	ВКМ_ДатаНачалаДействияДоговора = Элементы.Добавить("ВКМ_ДатаНачалаДействияДоговора", Тип("ПолеФормы"), ВКМ_ГруппаДатаОбслуживания);
	ВКМ_ДатаНачалаДействияДоговора.Вид = ВидПоляФормы.ПолеВвода;
	ВКМ_ДатаНачалаДействияДоговора.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДействияДоговора";
	
	ВКМ_ДатаОкончанияДействияДоговора = Элементы.Добавить("ВКМ_ДатаОкончанияДействияДоговора", Тип("ПолеФормы"), ВКМ_ГруппаДатаОбслуживания);
	ВКМ_ДатаОкончанияДействияДоговора.Вид = ВидПоляФормы.ПолеВвода;
	ВКМ_ДатаОкончанияДействияДоговора.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДействияДоговора";
	
	ВКМ_СуммаАбонентскойПлаты = Элементы.Добавить("ВКМ_СуммаАбонентскойПлаты", Тип("ПолеФормы"), ВКМ_ГруппаПараметрыОбслуживания);
	ВКМ_СуммаАбонентскойПлаты.Вид = ВидПоляФормы.ПолеВвода;
	ВКМ_СуммаАбонентскойПлаты.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";

	ВКМ_СтоимостьЧасаРаботы = Элементы.Добавить("ВКМ_СтоимостьЧасаРаботы", Тип("ПолеФормы"), ВКМ_ГруппаПараметрыОбслуживания);
	ВКМ_СтоимостьЧасаРаботы.Вид = ВидПоляФормы.ПолеВвода;
	ВКМ_СтоимостьЧасаРаботы.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
	
КонецПроцедуры

&НаСервере
Процедура ВКМ_ИзменитьВидимостьГруппыПараметрыОбслуживанияНаСервере()
	Если Объект.ВидДоговора <> ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		Элементы.ВКМ_ГруппаПараметрыОбслуживания.Видимость = Ложь;
	Иначе
		Элементы.ВКМ_ГруппаПараметрыОбслуживания.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВКМ_ИзменитьВидимостьГруппыПараметрыОбслуживания()
	Если Объект.ВидДоговора <> ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		Элементы.ВКМ_ГруппаПараметрыОбслуживания.Видимость = Ложь;
	Иначе
		Элементы.ВКМ_ГруппаПараметрыОбслуживания.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
